Dreamy-Z3r0/Clock-Project/Firmware/STM32-firmware/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LATCH_Pin GPIO_PIN_1
#define LATCH_GPIO_Port GPIOA
#define CLOCK_Pin GPIO_PIN_2
#define CLOCK_GPIO_Port GPIOA
#define YEAR_DATA_INPUT_Pin GPIO_PIN_3
#define YEAR_DATA_INPUT_GPIO_Port GPIOA
#define TIME_DATA_INPUT_Pin GPIO_PIN_4
#define TIME_DATA_INPUT_GPIO_Port GPIOA
#define DATE_DATA_INPUT_Pin GPIO_PIN_5
#define DATE_DATA_INPUT_GPIO_Port GPIOA
#define DP_PWM_Pin GPIO_PIN_6
#define DP_PWM_GPIO_Port GPIOA
#define EN_DIGIT_1_Pin GPIO_PIN_12
#define EN_DIGIT_1_GPIO_Port GPIOB
#define EN_DIGIT_2_Pin GPIO_PIN_13
#define EN_DIGIT_2_GPIO_Port GPIOB
#define EN_DIGIT_3_Pin GPIO_PIN_14
#define EN_DIGIT_3_GPIO_Port GPIOB
#define EN_DIGIT_4_Pin GPIO_PIN_15
#define EN_DIGIT_4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
